app/controllers/animals_controller.rb

SELECT  "owners".* FROM "owners" WHERE "owners"."user_id" = ? LIMIT 1  [["user_id", 3]]
INSERT INTO "animals" ("nome", "cor", "porte", "peso", "tipo_acao", "foto_file_name", "foto_content_type", "foto_file_size", "foto_updated_at", "sexo", "data_nascimento", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @owner = Owner.find(current_user.owner.id)
    @animal = Animal.new(animal_params)
    @animal.owner_id = @owner.id

    respond_to do |format|
      if @animal.save

DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 1]]
---
  def destroy
    @animal.destroy