app/controllers/owners_controller.rb

SELECT  "owners".* FROM "owners" WHERE "owners"."user_id" = ? LIMIT 1  [["user_id", 3]]
SELECT "animals".* FROM "animals" WHERE "animals"."owner_id" = ?  [["owner_id", 3]]
---
  def index
    @owners = Owner.where(user_id: current_user.id)
    @animals = Animal.where(owner_id: current_user.owner.id)

INSERT INTO "owners" ("nome", "cpf", "data_nascimento", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Barbara"], ["cpf", "10922459606"], ["data_nascimento", "1992-06-10"], ["created_at", "2019-06-10 21:21:58.652182"], ["updated_at", "2019-06-10 21:21:58.652182"]]
---
  def create
    @owner = Owner.new(owner_params)
    @owner.user_id = current_user.id

    respond_to do |format|
      if @owner.save

SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_owner
      @owner = Owner.find(params[:id])